Documents/УстановкаЦенЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>УстановкаЦенЗанятий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РасценкиЗанятий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасценкиЗанятий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДлительностьЗанятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обучающийся</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РасценкиЗанятий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>РасценкиЗанятий</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДлительностьЗанятия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДлительностьЗанятий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УстановкаЦенЗанятий/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Преподаватель = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	
	Если Объект.Преподаватель.Пустая() Тогда
		Предупреждение("Выберите преподавателя!");
		Возврат;
	КонецЕсли;
	
	ЗаполнитьТаблицуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНаСервере()
	
	Запрос = Новый Запрос ("ВЫБРАТЬ
	                       |	Обучающиеся.Ссылка КАК Обучающийся,
	                       |	ДлительностьЗанятий.Ссылка КАК ДлительностьЗанятия
	                       |ПОМЕСТИТЬ ВТ_УченикиИДлительность
	                       |ИЗ
	                       |	Справочник.Обучающиеся КАК Обучающиеся,
	                       |	Справочник.ДлительностьЗанятий КАК ДлительностьЗанятий
	                       |ГДЕ
	                       |	НЕ Обучающиеся.ЭтоГруппа
	                       |;
	                       |
	                       |////////////////////////////////////////////////////////////////////////////////
	                       |ВЫБРАТЬ
	                       |	ВТ_УченикиИДлительность.Обучающийся,
	                       |	ВТ_УченикиИДлительность.ДлительностьЗанятия,
	                       |	ЕСТЬNULL(РасценкиЗанятийСрезПоследних.Цена, 0) КАК Цена
	                       |ИЗ
	                       |	ВТ_УченикиИДлительность КАК ВТ_УченикиИДлительность
	                       |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасценкиЗанятий.СрезПоследних(, Преподаватель = &Преподаватель) КАК РасценкиЗанятийСрезПоследних
	                       |		ПО ВТ_УченикиИДлительность.Обучающийся = РасценкиЗанятийСрезПоследних.Обучающийся
	                       |			И ВТ_УченикиИДлительность.ДлительностьЗанятия = РасценкиЗанятийСрезПоследних.ДлительностьЗанятия
	                       |
	                       |УПОРЯДОЧИТЬ ПО
	                       |	ВТ_УченикиИДлительность.Обучающийся.Родитель,
	                       |	ВТ_УченикиИДлительность.Обучающийся.Наименование,
	                       |	ВТ_УченикиИДлительность.ДлительностьЗанятия.ЗначениеМинут");
	
	Запрос.УстановитьПараметр("Преподаватель", Объект.Преподаватель);
	Результат = Запрос.Выполнить().Выгрузить();
	Объект.РасценкиЗанятий.Загрузить(Результат);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ЗаполнитьЦеныДляТекущегоРодителя(Команда)
//	стрЭталон = Элементы.РасценкиЗанятий.ТекущиеДанные;	
//	ЗаполнитьЦеныДляТекущегоРодителяНаСервере(стрЭталон);
//КонецПроцедуры

//&НаСервере
//Процедура ЗаполнитьЦеныДляТекущегоРодителяНаСервере(Эталон)
//	
//КонецПроцедуры
